/************************************************************************************************
* @file    main.c
* @author  亓岳鑫
* @email   qiyuexin@yeah.net
* @Version V2.0
* @date    May 24th, 2018.
* @brief   None
************************************************************************************************/


#include <stdbool.h>
#include <stdint.h>

#include "platform.h"

#include "fc/fc_init.h"

#include "scheduler/scheduler.h"

#include "bitops.h"
// 记得添加：
// mpuResetFn,  L27 @system_stm32f4.c
//     targetConfiguration();   L455,@config.c

//  *=============================================================================
//  *                    Supported STM32F42xxx/43xxx devices
//  *-----------------------------------------------------------------------------
//  *        System Clock source                    | PLL (HSE)
//  *-----------------------------------------------------------------------------
//  *        SYSCLK(Hz)                             | 180000000
//  *-----------------------------------------------------------------------------
//  *        HCLK(Hz)                               | 180000000
//  *-----------------------------------------------------------------------------
//  *        AHB Prescaler                          | 1
//  *-----------------------------------------------------------------------------
//  *        APB1 Prescaler                         | 4
//  *-----------------------------------------------------------------------------
//  *        APB2 Prescaler                         | 2
//  *-----------------------------------------------------------------------------
//  *        HSE Frequency(Hz)                      | 24000000

int main(void)
{
    init();
    while (true) {
        scheduler();
        processLoopback();
#ifdef SIMULATOR_BUILD
        delayMicroseconds_real(50); // max rate 20kHz
#endif
    }

    return 0;
}
